function templateGenerator(type, postTitle, postDescription) {
	switch (type) {
		case 'mockup':
			return `در این پست موکاپ ${postTitle} برای دانلود در ایران جی اف ایکس قرار گرفته است. شما با استفاده از این موکاپ ${postDescription}.
			اما موکاپ چیست ؟ پیکر نما (mock-up) فایل پیش نمایش یا موکاپ (Mockup) ، قالب‌های گرافیکی آماده‌ای هستند که در موضوعات مختلف و با فرمت PSD می‌توان در امور طراحی به بهترین شکل ممکن برای پیش نمایش طراحی های مربوطه  از آن‌ها استفاده نمود . البته موکاپ هایی به صورت وکتور برای ویرایش در نرم افزار ایلوستریتور نیز وجود دارد . موکاپ یک نمونه شبیه سازی شده از طرحی است که در فضای واقعی قرار گرفته است ، در اصل عملکرد موکاپ به گونه‌ای است که طرح را در حالت اجرا شده (چاپ شده ، پوستر روی دیوار ، تراکت و سربرگ روی میز ،‌ قاب و بنر روی دیوار ، در یک دیوایس دیجیتال مثل تبلت قرارگرفته) نمایش می‌دهد. در موکاپ تلاش می‌شود علاوه بر نمایش کامل طرح ، حس طرح اجرا شده و قرار گرفته در دنیای واقعی را به مشتری القا کرد، تا مشتری برای تصمیم گیری و تصور طرح اجرا شده دچار مشکل و تردید نشود. اگر یک موکاپ به طور استاندارد و حرفه‌ای ساخته شده باشد شما امکان ویرایش تک تک اجزای تصویر را خواهید داشت ، می‌توانید نور را کنترل کنید ، پس زمینه را تغییر دهید و وجود یا عدم وجود المان‌های مختلف در تصویر را تعیین کنید . متأسفانه در کشور ما در بحث آموزش گرافیک در دانشگاه‌ها و آموزشگاه‌های خصوصی آن‌قدر که بر روی تکنیک اجرا و هنر طراحی تأکید می‌شود به بحث ارائه ، پرزنت و ارتباط با مشتری پرداخته نمی‌شود به همین دلیل دانشجویان و فارغ‌التحصیلان گرافیک هرچقدر هم که در زمینه طراحی حرفه‌ای باشند باز هم برای ارتباط با مشتری و ارائه طرح به آن‌ها دچار مشکل می‌شوند . به طوری که حتی طرح های نسبات معمولی را توسط این موکاپ می توان به شکلی بسیار زیباتر و جذاب تر به مخاطب ارائه داد . یکی از مواردی که هر طراح گرافیکی از دانشجو و فارغ‌التحصیل گرفته تا یک استاد باتجربه باید در نظر داشته باشد ارائه مناسب طرح و متقاعد کردن صحیح مشتری برای پذیرفتن طرح ارائه شده هست. زیرا شما به عنوان یک فروشنده و دیزاینر میبایست مشتری خود را راضی نگه دارید . اکثر طراحان گرافیک سفارش‌های تکمیل‌شده مشتری را به‌صورت کاملاً فلت و دو بعدی و به صورت طرح نهایی ارائه می‌دهند که همین امر باعث می‌شود مشتری نتواند با طرح ارائه شده رابطه برقرار کند و طرح را در قالبی که قرار است به صورت نهایی تحویل بگیرد تصور کند ،‌ بنابرین طرح را رد می‌کند .
			اگر در طراحی های خود از این ${postTitle} استفاده کردید، لطفا دیدگاه و عکس طراحی خود را از بخش پرسش و پاسخ انتهای صفحه با ما و سایر کاربران ایران جی اف ایکس به اشتراک بگذارید.
			این پرسش و پاسخ ها سعی دارد به کاربران سایت <strong>ایران جی اف ایکس</strong> در رفع مشکلات احتمالی شان کمک کند و همچنین تجربه شما در طراحی های متنوع را با دیگران به اشتراک بگذارد. با عمل به این کار پس از مدتی کوتاه همه علاقه مندان به دنیای طراحی گرافیک می توانند ازمزایای این فعالیت اجتماعی بهره مند شوند .
			
			<h2>نمونه تصاویر موکاپ ${postTitle}:</h2>
			برای مشاهده تصاویر با سایز بزرگ بر روی عکس کلیک کنید.
			`;	
		default:
			break;
	}
	return "";
}
